cars_app/cars_app_api/app/controllers/manufacturers_controller.rb

SELECT "manufacturers".* FROM "manufacturers"
---
  def index
    @manufacturers = Manufacturer.all

SELECT "manufacturers".* FROM "manufacturers" WHERE "manufacturers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_manufacturer
      @manufacturer = Manufacturer.find(params[:id])