cars_app/cars_app_api/app/controllers/models_controller.rb

  def index
    @models = Model.all
---
SELECT "models".* FROM "models"

  def create
    @model = Model.new(model_params)
    @model.manufacturer_id = params[:manufacturer_id]

    if @model.save
---
INSERT INTO "models" ("car_name", "price", "created_at", "updated_at", "manufacturer_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["car_name", "\"testcar\""], ["price", 123000], ["created_at", "2020-02-07 20:41:43.837142"], ["updated_at", "2020-02-07 20:41:43.837142"], ["manufacturer_id", 1]]

    def set_model
      @model = Model.find(params[:id])
---
SELECT "models".* FROM "models" WHERE "models"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]